app/controllers/posts_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", nil]]
---
  def index
    #find the review for the id provided
    @review = Review.find(params[:review_id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."review_id" = ? AND "posts"."id" = ? LIMIT 1  [["review_id", 1], ["id", 1]]
---
  def show
    @review = Review.find(params[:review_id])
    @post = @review.posts.find(params[:id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    @review = Review.find(params[:review_id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."review_id" = ? AND "posts"."id" = ? LIMIT 1  [["review_id", 1], ["id", 2]]
---
  def edit
    @review = Review.find(params[:review_id])
    @post = @review.posts.find(params[:id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "posts" ("post_message", "review_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_message", "test"], ["review_id", 1], ["created_at", "2016-03-25 02:41:46.088350"], ["updated_at", "2016-03-25 02:41:46.088350"]]
---
  def create
    @review = Review.find(params[:review_id])
    @post = @review.posts.build(post_params)

      if @post.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
---
  def update
    @review = Review.find(params[:review_id])
    @post = Post.find(params[:id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
---
  def destroy
    @review = Review.find(params[:review_id])
    @post = Post.find(params[:id])
    @post.destroy