app/controllers/profiles_controller.rb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT 1  [["user_id", 3]]
---
  def signedinuserprofile profile =
    Profile.find_by_user_id(current_user.id)

INSERT INTO "profiles" ("firstname", "lastname", "address", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["firstname", "Kellie"], ["lastname", "Hughes"], ["address", "20 Clanree Road"], ["user_id", 3], ["created_at", "2016-03-24 20:28:08.281492"], ["updated_at", "2016-03-24 20:28:08.281492"]]
---
  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save