app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("review_title", "created_at", "updated_at") VALUES (?, ?, ?)  [["review_title", "Good"], ["created_at", "2016-03-25 02:05:50.715118"], ["updated_at", "2016-03-25 02:05:50.715118"]]
---
  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save