app/controllers/tours_controller.rb

    logger.logInformation("a new car requested:" + @tour.description)

    respond_to do |format|
      if @tour.save
---
INSERT INTO "tours" ("firstname", "lastname", "language", "description", "cost", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    }

    respond_to do |format|
      if @tour.update(tour_params)
---
UPDATE "tours" SET "firstname" = ?, "updated_at" = ? WHERE "tours"."id" = ?  [["firstname", "Kellie"], ["updated_at", "2016-03-24 15:49:41.168086"], ["id", 4]]

    def set_tour
      @tour = Tour.find(params[:id])
---
SELECT  "tours".* FROM "tours" WHERE "tours"."id" = ? LIMIT 1  [["id", 4]]