app/views/reviews/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."review_id" = ?  [["review_id", 2]]
---
<h2>Posts</h2>
<% @review.posts.each do |p| %>